In [1]:
import pandas as pd
import numpy as np

# 5.1 Query

In [9]:
data = [
    
    {"cd":"A060310","nm":'3s', 'open':2920,'close':2800},
    {"cd":"A095570","nm":'AJ네트웍스','open':1920,'close':1900},
    {"cd":"A006840","nm":'AK홀딩스', 'open':2020,'close':2010},
    {"cd":"A006840","nm":'APS홀딩스', 'open':3120, 'close':3200},
    
]

df = pd.DataFrame(data = data)

df = df.set_index('cd') # 이렇게 하면 인덱스를 세팅 할 수 있구나,,

print(df)

             nm  open  close
cd
A060310      3s  2920   2800
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010
A006840  APS홀딩스  3120   3200

In [10]:
# 원래 하던 방법

cond = df['open']>=2000

In [12]:
df[cond]

             nm  open  close
cd
A060310      3s  2920   2800
A006840   AK홀딩스  2020   2010
A006840  APS홀딩스  3120   3200

##### Query라고 불리는특수한 명령을 query메서드로 전달하면 됨

##### 큰 따옴표로 전체 쿼리를 정의하고

##### 쿼리 안에서 사용하는 문자열은 작은 따옴표로 구분

In [13]:
df.query(" nm == '3s' ")

         nm  open  close
cd
A060310  3s  2920   2800

In [15]:
# 부등호도 가능하다

df.query('open > close')

             nm  open  close
cd
A060310      3s  2920   2800
A095570  AJ네트웍스  1920   1900
A006840   AK홀딩스  2020   2010

In [17]:
df.query(" nm in ['3s', 'AK홀딩스']")

# in 연산자는 뒤에 나오는 자료구조에 나열된 데이터만을 선택

            nm  open  close
cd
A060310     3s  2920   2800
A006840  AK홀딩스  2020   2010

In [20]:
# 인덱스를 기준으로도 조회 가능하다

df.query("cd == 'A060310'")

         nm  open  close
cd
A060310  3s  2920   2800

In [23]:
# 쿼리에서 "@"키워드를 사용하면 파이선 변수를 참조 할 수 있습니다.

name = "AJ네트웍스"

df.query(" nm == @name ")

             nm  open  close
cd
A095570  AJ네트웍스  1920   1900

# 5.2 Filter

In [26]:
# query 메서드가 값을 이용해서 필터링

# Filter 메서드는 인덱스나 칼럼 이름에 대해서 특정 조건으로 필터링

data = [
    [1416,1416,2994,1755],
    [6.42,17.63,21.09,13.93],
    [1.10,1.49,2.09,1.88]
]

columns = ["2018/12","2019/12","2020/12","2021/12(E)"]
index = ['DPS','PER','PBR']

df = pd.DataFrame(data=data, columns = columns, index = index)

In [30]:
# filter method; item parameter로 선택한 컬럼의 이름을 지정

df.filter(items = ['2018/12'])

     2018/12
DPS  1416.00
PER     6.42
PBR     1.10

In [31]:
data =[
    [1416.00,1416,2994,1755],
    [6.42,17.63,21.09,13.93],
    [1.10,1.49,2.06,1.88]
]

index =['DPS','PER','PBR']